app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "access_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
      def create
        @user = User.create!(create_params)